In [74]:
import pandas as pd
import pygal

In [75]:
df=pd.read_excel('/Users/Laura/Desktop/COTRAPSA/Analisis Ordenes de compra/Ordenes_compra.xlsx')

In [76]:
df.shape

(140, 7)

In [77]:
df.sample(100).Estatus.value_counts(normalize=True)

Comprada     0.69
Emitida      0.23
Com.Parc.    0.07
Cancelada    0.01
Name: Estatus, dtype: float64

In [78]:
df=df[df['Estatus'].isin(['Comprada','Com.Parc.'])]
df.reset_index(inplace=True,drop=True)

In [79]:
df.head()

,Nombre,Estatus,Fecha_docum,Fecha_recepc,Subtotal,Moneda,Total
0,"ENTORNO INDUSTRIAL, S.A. DE C.V.",Comprada,2016-01-06,2016-01-06,14094.00,1.0,16349.04
1,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-01-12,2016-01-12,4799.39,1.0,5567.29
2,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-02-05,2016-02-05,640545.81,2.0,743033.16
3,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-02-18,2016-02-18,193784.91,2.0,224790.58
4,SEALCO COMMERCIAL VEHICLE PRO,Com.Parc.,2016-04-04,2016-04-04,507100.46,2.0,588236.56

In [80]:
df.Total.sum()

15175820.45

In [81]:
df['año']=df.Fecha_docum.map(lambda x:x.strftime('%Y'))
df['año_mes']=df.Fecha_docum.map(lambda x:x.strftime('%Y%m'))
df['mes']=df.Fecha_docum.map(lambda x:x.strftime('%m'))

In [82]:
df2016=df[df.año=='2016']
df2017=df[df.año=='2017']
df2018=df[df.año=='2018']
df2019=df[df.año=='2019']

In [83]:
df2016.head()

,Nombre,Estatus,Fecha_docum,Fecha_recepc,Subtotal,Moneda,Total,año,año_mes,mes
0,"ENTORNO INDUSTRIAL, S.A. DE C.V.",Comprada,2016-01-06,2016-01-06,14094.00,1.0,16349.04,2016,201601,01
1,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-01-12,2016-01-12,4799.39,1.0,5567.29,2016,201601,01
2,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-02-05,2016-02-05,640545.81,2.0,743033.16,2016,201602,02
3,SEALCO COMMERCIAL VEHICLE PRO,Comprada,2016-02-18,2016-02-18,193784.91,2.0,224790.58,2016,201602,02
4,SEALCO COMMERCIAL VEHICLE PRO,Com.Parc.,2016-04-04,2016-04-04,507100.46,2.0,588236.56,2016,201604,04

In [84]:
df.shape

(107, 10)

In [85]:
df.sample(107).Moneda.value_counts(normalize=True)

2.0    0.906542
1.0    0.093458
Name: Moneda, dtype: float64

In [86]:
df[['Nombre','Total']].groupby('Nombre').sum()

                                         Total
Nombre
BRANDES INTERNATIONAL CO.            245393.63
COMERCIALIZADORA SUDIMEX, S.DE        16240.00
ENTORNO INDUSTRIAL, S.A. DE C.V.      23640.22
FRUEHAUF DE MEXICO, S.A. DE C.V.      31668.00
M & M GLOBAL GROUP INC                40196.55
MERITOR MEXICO, S.DE R.L. DE C.V.   1156617.07
SEALCO COMMERCIAL VEHICLE PRO      13335121.97
WABCO AUTOMOTIVE NORTH AMERI         326943.01

In [87]:
ordenes_2016_2019_anual=df[['año','Total']].groupby('año').sum()

In [88]:
ordenes_2016_2019_anual

           Total
año
2016  4431341.38
2017  2800273.43
2018  4756684.13
2019  3187521.51

In [89]:
ordenes_2016=df2016[['año_mes','Total']].groupby('año_mes').sum()
ordenes_2017=df2017[['año_mes','Total']].groupby('año_mes').sum()
ordenes_2018=df2018[['año_mes','Total']].groupby('año_mes').sum()
ordenes_2019=df2019[['año_mes','Total']].groupby('año_mes').sum()

In [90]:
ordenes_2016

             Total
año_mes
201601    21916.33
201602   967823.74
201604   774585.33
201606   781352.57
201607    67848.99
201608   400589.34
201609   519119.84
201610   389147.44
201611    82737.80
201612   426220.00

In [91]:
ordenes_2016_mes=df2016[['mes','Total']].groupby('mes').sum()
ordenes_2017_mes=df2017[['mes','Total']].groupby('mes').sum()
ordenes_2018_mes=df2018[['mes','Total']].groupby('mes').sum()
ordenes_2019_mes=df2019[['mes','Total']].groupby('mes').sum()

In [105]:
proveedores_2016=df2016[['Nombre','Total']].groupby('Nombre').sum()
proveedores_2017=df2017[['Nombre','Total']].groupby('Nombre').sum()
proveedores_2018=df2018[['Nombre','Total']].groupby('Nombre').sum()
proveedores_2019=df2019[['Nombre','Total']].groupby('Nombre').sum()
proveedores_total=df[['Nombre','Total']].groupby('Nombre').sum()

In [98]:
line_chart = pygal.Line()
line_chart.title = 'Ordenes de compra'
line_chart.x_labels = ordenes_2017_mes.index
line_chart.add('2016',ordenes_2016_mes.Total )
line_chart.add('2017', ordenes_2017_mes.Total)
line_chart.add('2018', ordenes_2018_mes.Total)
line_chart.add('2019', ordenes_2019_mes.Total)
line_chart.render_to_file('Ordenes_mes.svg')

In [107]:
line_chart = pygal.HorizontalBar()
line_chart.title = 'Proveedores'
line_chart.x_labels =proveedores_total.index
line_chart.add('2019', proveedores_2019.Total)
line_chart.add('2018', proveedores_2018.Total)
line_chart.add('2017', proveedores_2017.Total)
line_chart.add('2016', proveedores_2016.Total)
line_chart.render_to_file('Proveedores.svg')

In [110]:
proveedores_2018

                                        Total
Nombre
BRANDES INTERNATIONAL CO.            97984.64
COMERCIALIZADORA SUDIMEX, S.DE        5336.00
ENTORNO INDUSTRIAL, S.A. DE C.V.      1862.21
M & M GLOBAL GROUP INC               12862.08
MERITOR MEXICO, S.DE R.L. DE C.V.   669078.51
SEALCO COMMERCIAL VEHICLE PRO      3956837.08
WABCO AUTOMOTIVE NORTH AMERI         12723.61